kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
#include "panel_key.h"
#include "device_manager.h"
#include <float.h>
#include "gd32e23x.h"
#include "FreeRTOS.h"
#include "timers.h"
#include "../base/debug.h"
#include "../base/base.h"
#include "../adc/adc.h"
#include "../gpio/gpio.h"
#include "../usart/usart.h"
#include "../base/panel_base.h"
#include "../eventbus/eventbus.h"
#include "../protocol/protocol.h"
#include "../pwm/pwm.h"
#include "../config/config.h"

#if defined PANEL_KEY

    #define ADC_TO_VOLTAGE(adc_val) ((adc_val) * 330 / 4096) // adc值转电压

    #define ADC_VALUE_COUNT         10 // 电压值缓冲区数量

    #define DEFAULT_MIN_VALUE       329 // 无按键按下时的最小电压值
    #define DEFAULT_MAX_VALUE       330 // 无按键按下时的最大电压值

    #define SHORT_TIME_LED          100   // 短亮时间
    #define SHORT_TIME_RELAY        30000 // 继电器导通时间
    #define LONG_PRESS              300   // 长按时间

    #define FADE_TIME               500

    // 函数参数
    #define FUNC_PARAMS valid_data_t *data, const panel_cfg_t *temp_cfg, panel_status_t *temp_status
    #define FUNC_ARGS   data, temp_cfg, temp_status

    // 外层遍历
    #define PROCESS_OUTER(cfg, status, ...)               \
        do {                                              \
            for (uint8_t _i = 0; _i < KEY_NUMBER; _i++) { \
                const panel_cfg_t *p_cfg = &(cfg)[_i];    \
                panel_status_t *p_status = &(status)[_i]; \
                __VA_ARGS__                               \
            }                                             \
        } while (0)

    // 内层遍历
    #define PROCESS_INNER(cfg_ex, status_ex, ...)               \
        do {                                                    \
            for (uint8_t _j = 0; _j < KEY_NUMBER; _j++) {       \
                const panel_cfg_t *p_cfg_ex = &(cfg_ex)[_j];    \
                panel_status_t *p_status_ex = &(status_ex)[_j]; \
                __VA_ARGS__                                     \
            }                                                   \
        } while (0)

typedef struct {
    // 用于处理adc数据
    bool buf_full;   // 缓冲区填满标志位
    uint8_t buf_idx; // 缓冲区下标
    uint16_t vol;    // 电压值
    uint16_t vol_buf[ADC_VALUE_COUNT];
} adc_value_t;

typedef struct {
    uint16_t min;
    uint16_t max;
} key_vol_t;

typedef struct { // 用于每个按键的状态

    bool key_press;  // 按键按下
    bool key_status; // 按键状态

    bool led_w_open;  // 白灯状态
    bool led_w_short; // 启用短亮(窗帘开关)
    bool led_w_last;  // 白灯上次状态

    bool led_y_open; // 黄灯状态
    bool led_y_last; // 黄灯上次状态

    bool relay_open;  // 继电状态
    bool relay_short; // 继电器短开
    bool relay_last;  // 继电器上次状态

    uint16_t led_w_short_count; // 短亮计数器
    uint32_t relay_open_count;  // 继电器导通计数器
    const key_vol_t vol_range;  // 按键电压范围

} panel_status_t;

typedef struct
{
    bool led_filck;           // 闪烁
    bool key_long_press;      // 长按状态
    bool enter_config;        // 进入配置状态
    uint16_t back_lum;        // 所有背光灯亮度
    uint16_t key_long_count;  // 长按计数
    uint16_t led_filck_count; // 闪烁计数
} common_panel_t;

static common_panel_t my_common_panel;
static adc_value_t my_adc_value;
static panel_status_t my_panel_status[KEY_NUMBER] = {

    #if defined PANEL_6KEY
    [0] = {.vol_range = {0, 15}},
    [1] = {.vol_range = {25, 45}},
    [2] = {.vol_range = {85, 110}},
    [3] = {.vol_range = {145, 155}},
    [4] = {.vol_range = {195, 210}},
    [5] = {.vol_range = {230, 255}},
    #endif

    #if defined PANEL_8KEY
    [0] = {.vol_range = {0, 15}},
    [1] = {.vol_range = {25, 45}},
    [2] = {.vol_range = {85, 110}},
    [3] = {.vol_range = {145, 155}},
    #endif
};

    #if defined PANEL_8KEY // 8键采用两组4键的方式
static common_panel_t my_common_panel_ex;
static adc_value_t my_adc_value_ex;
static panel_status_t my_panel_status_ex[KEY_NUMBER] = {
    [0] = {.vol_range = {0, 15}},
    [1] = {.vol_range = {25, 45}},
    [2] = {.vol_range = {85, 110}},
    [3] = {.vol_range = {145, 155}},
};

    #endif

// 函数声明
static void panel_gpio_init(void);
static void panel_power_status(void);
static void panel_data_cb(valid_data_t *data);
static void panel_read_adc(TimerHandle_t xTimer);
static void panel_proce_cmd(TimerHandle_t xTimer);
static void panel_ctrl_led_all(bool led_state, bool is_ex);
static void panel_event_handler(event_type_e event, void *params);
static void process_led_flicker(common_panel_t *common_panel, bool is_ex_panel);
static void panel_fast_exe(panel_status_t *temp_fast, uint8_t flag);
static void process_exe_status(const panel_cfg_t *temp_cfg, panel_status_t *temp_status);
static void process_exe_power(const panel_cfg_t *temp_cfg, panel_status_t *temp_status);
static void process_cmd_check(FUNC_PARAMS);
static void process_panel_adc(panel_status_t *panel_status, common_panel_t *common_panel, adc_value_t *adc_value, bool is_ex);
static void panel_all_close(FUNC_PARAMS);
static void panel_all_on_off(FUNC_PARAMS);
static void panel_curtain_open(FUNC_PARAMS);
static void panel_curtain_close(FUNC_PARAMS);
static void panel_curtain_stop(FUNC_PARAMS);
static void panel_clean_room(FUNC_PARAMS);
static void panel_dnd_mode(FUNC_PARAMS);
static void panel_later_mode(FUNC_PARAMS);
static void panel_chect_out(FUNC_PARAMS);
static void panel_sos_mode(FUNC_PARAMS);
static void panel_service(FUNC_PARAMS);
static void panel_scene_mode(FUNC_PARAMS);
static void panel_light_mode(FUNC_PARAMS);
static void panel_night_light(FUNC_PARAMS);

void panel_key_init(void)
{
    panel_gpio_init();
    adc_channel_t my_adc_channel = {0};
    app_pwm_init(); // 初始化 PWM 模块
    #if defined PANEL_4KEY

    #endif

    #if defined PANEL_6KEY
    my_adc_channel.adc_channel_0 = true;
    app_adc_init(&my_adc_channel);

    app_pwm_add_pin(PA8);
    app_set_pwm_fade(PA8, 500, 3000);
    #endif

    #if defined PANEL_8KEY
    my_adc_channel.adc_channel_0 = true;
    my_adc_channel.adc_channel_1 = true;
    app_adc_init(&my_adc_channel);

    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        app_pwm_add_pin(app_get_panel_cfg()[i].led_y_pin);
        app_pwm_add_pin(app_get_panel_cfg_ex()[i].led_y_pin);
    };

