kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void process_exe_status(const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        panel_status_t *p_status = &temp_status[i];
        const panel_cfg_t *p_cfg = &temp_cfg[i];

        if (p_status->led_w_short) { // 白灯短亮逻辑
            if (p_status->led_w_short_count++ == 0) {
                p_status->led_w_open = true;
            }
            if (p_status->led_w_short_count >= SHORT_TIME_LED) {
                p_status->led_w_open        = false;
                p_status->led_w_short       = false;
                p_status->led_w_short_count = 0;
            }
        }
        if (p_status->relay_short) { // 继电器短开逻辑
            if (p_status->relay_open_count++ == 0) {
                p_status->relay_open = true;
            }
            if (p_status->relay_open_count >= SHORT_TIME_RELAY) {
                p_status->relay_open       = false;
                p_status->relay_short      = false;
                p_status->led_w_open       = false;
                p_status->key_status       = false;
                p_status->relay_open_count = 0;
            }
        }
        if (p_status->led_w_open != p_status->led_w_last) { // 白灯状态更新
            APP_SET_GPIO(p_cfg->led_w_pin, p_status->led_w_open);
            p_status->led_w_last = p_status->led_w_open;
            app_set_pwm_fade(p_cfg->led_y_pin, p_status->led_w_open ? 0 : 500, FADE_TIME);
        }

        if (p_status->relay_open != p_status->relay_last) { // 继电器状态更新
            APP_SET_GPIO(p_cfg->relay_pin[0], p_status->relay_open);
            APP_SET_GPIO(p_cfg->relay_pin[1], p_status->relay_open);
            APP_SET_GPIO(p_cfg->relay_pin[2], p_status->relay_open);
            APP_SET_GPIO(p_cfg->relay_pin[3], p_status->relay_open);
            p_status->relay_last       = p_status->relay_open;
            p_status->relay_open_count = 0;
        }
    }
}

static void panel_data_cb(valid_data_t *data)
{
    // 0:固定码,1:按键功能,2:操作指令,3:分组,4:总关/场景区域,5:校验码,6:按键权限,7:场景分组
    APP_PRINTF_BUF("[RECV]", data->data, data->length);
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();
    process_cmd_check(data, temp_cfg, my_panel_status);

    #if defined PANEL_8KEY
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    process_cmd_check(data, temp_cfg_ex, my_panel_status_ex);
    #endif
}

static void process_cmd_check(FUNC_PARAMS)
{
    switch (data->data[1]) {
        case ALL_CLOSE: // 总关
            panel_all_close(FUNC_ARGS);
            break;
        case ALL_ON_OFF: // 总开关
            panel_all_on_off(FUNC_ARGS);
            break;
        case CLEAN_ROOM: // 清理房间
            panel_clean_room(FUNC_ARGS);
            break;
        case DND_MODE: // 勿扰模式
            panel_dnd_mode(FUNC_ARGS);
            break;
        case LATER_MODE: // 请稍后
            panel_later_mode(FUNC_ARGS);
            break;
        case CHECK_OUT: // 退房
            panel_chect_out(FUNC_ARGS);
            break;
        case SOS_MODE: // 紧急呼叫
            panel_sos_mode(FUNC_ARGS);
            break;
        case SERVICE: // 请求服务
            panel_service(FUNC_ARGS);
            break;
        case CURTAIN_OPEN: // 窗帘开
            panel_curtain_open(FUNC_ARGS);
            break;
        case CURTAIN_CLOSE: // 窗帘关
            panel_curtain_close(FUNC_ARGS);
            break;
        case SCENE_MODE: // 场景模式
            panel_scene_mode(FUNC_ARGS);
            break;
        case LIGHT_MODE: // 灯控模式
            panel_light_mode(FUNC_ARGS);
            break;
        case NIGHT_LIGHT: // 夜灯
            panel_night_light(FUNC_ARGS);
            break;
        case LIGHT_UP:
            break;
        case LIGHT_DOWN:
            break;
        case DIMMING_3:
            break;
        case DIMMING_4:
            break;
        case UNLOCKING:
            break;
        case BLUETOOTH:
            break;
        case CURTAIN_STOP: // 窗帘停
            panel_curtain_stop(FUNC_ARGS);
            break;
        case VOLUME_ADD:
            break;
        case VOLUME_SUB:
            break;
        case PLAY_PAUSE:
            break;
        case NEXT_SONG:
            break;
        case LAST_SONG:
            break;
        default:
            return;
    }
}

static void panel_ctrl_led_all(bool led_state, bool is_ex)
{
    panel_status_t *temp = NULL;
    #ifndef PANEL_8KEY
    temp = my_panel_status;
    #endif
    #if defined PANEL_8KEY
    temp = is_ex ? my_panel_status_ex : my_panel_status;
    #endif
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        temp[i].led_w_open = led_state;
    }
}

static void panel_event_handler(event_type_e event, void *params)
{
    switch (event) {
        case EVENT_ENTER_CONFIG: {
            panel_ctrl_led_all(true, false);
            my_common_panel.enter_config = true;
        } break;
        case EVENT_EXIT_CONFIG: {
            panel_ctrl_led_all(false, false);
            my_common_panel.enter_config = false;
            NVIC_SystemReset(); // 退出"配置模式"后触发软件复位
        } break;
        case EVENT_SAVE_SUCCESS: {
            my_common_panel.led_filck = true;
        } break;
    #if defined PANEL_8KEY
        case EVENT_ENTER_CONFIG_EX:
            panel_ctrl_led_all(true, true);
            my_common_panel_ex.enter_config = true;
            break;
        case EVENT_EXIT_CONFIG_EX: {
            panel_ctrl_led_all(false, true);
            my_common_panel_ex.enter_config = false;
            NVIC_SystemReset();
        } break;
        case EVENT_SAVE_SUCCESS_EX: {
            my_common_panel_ex.led_filck = true;
        } break;
    #endif
        case EVENT_RECEIVE_CMD: {
            valid_data_t *valid_data = (valid_data_t *)params;
            panel_data_cb(valid_data);
        } break;
        default:
            return;
    }
}

// 执行上电参数(迎宾)
static void panel_power_status(void)
{
    process_exe_power(app_get_panel_cfg(), my_panel_status);
    #if defined PANEL_8KEY
    process_exe_power(app_get_panel_cfg_ex(), my_panel_status_ex);
    #endif
}

static void process_exe_power(const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        const panel_cfg_t *p_cfg = &temp_cfg[i];
        panel_status_t *p_status = &temp_status[i];
        if (BIT3(p_cfg->perm) == true) { // 权限是否勾选"迎宾"
            switch (p_cfg->func) {
                case LIGHT_MODE:
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x01);
                    break;
                case SCENE_MODE: // 场景模式,不开白灯
                    panel_fast_exe(p_status, (0b00010000 & ~0x01) | 0x01);
                    break;
                default:
                    break;
            }
        }
    }
}

static void panel_fast_exe(panel_status_t *temp_fast, uint8_t flag)
{
    // 0位:data->data[2];1位:key_status;2位:led_w_open,3位:led_w_short,4位:relay_open;5位:relay_short;6位:保留;7位:保留

    if (BIT1(flag) == true) {
        temp_fast->key_status = BIT0(flag);
    }
    if (BIT2(flag) == true) {
        temp_fast->led_w_open = BIT0(flag);
    }
    if (BIT3(flag) == true) {
        temp_fast->led_w_short = true; // 短亮会快速熄灭,无需持续状态,故而不受data->data[2]控制
    }
    if (BIT4(flag) == true) {
        temp_fast->relay_open = BIT0(flag);
    }
    if (BIT5(flag) == true) {
        temp_fast->relay_short = BIT0(flag);
    }
}

static void panel_all_close(FUNC_PARAMS) // 总关
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if ((BIT5(p_cfg->perm) == true) && // "睡眠"被勾选,"总开关分区"相同 或 0xF
            ((H_BIT(data->data[4]) == H_BIT(p_cfg->area)) || (H_BIT(data->data[4]) == 0xF))) {
            switch (p_cfg->func) {
                case ALL_CLOSE:
                    if (data->data[3] == p_cfg->group) {
                        panel_fast_exe(p_status, (0b00011010 & ~0x01) | (data->data[2] & 0x01));
                    }
                    break;
                case NIGHT_LIGHT:
                case DND_MODE:
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x01);
                    break;
                case SCENE_MODE:
                case LIGHT_MODE:
                case ALL_ON_OFF:
                case CLEAN_ROOM:
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x00);
                    break;
                case CURTAIN_CLOSE: // "总关"可联动"窗帘关"
                    panel_curtain_close(FUNC_ARGS);
                    break;
                default:
                    break;
            }
        }
    });
}

static void panel_all_on_off(FUNC_PARAMS) // 总开关
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if ((BIT0(p_cfg->perm) == true) && // "总开关"被勾选,"总开关分区"相同 或 0xF
            ((H_BIT(data->data[4]) == H_BIT(p_cfg->area)) || (H_BIT(data->data[4]) == 0xF))) {
            switch (p_cfg->func) {
                case ALL_ON_OFF:
                    if (data->data[3] == p_cfg->group) {
                        panel_fast_exe(p_status, (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                    }
                    break;
                case NIGHT_LIGHT:
                case DND_MODE:
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                    break;
                case SCENE_MODE: // 场景模式无法通过"总开关"打开
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x00);
                    break;
                case LIGHT_MODE:
                case CLEAN_ROOM:
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                    break;
                case ALL_CLOSE:
                    panel_fast_exe(p_status, (0b00011010 & ~0x01) | (data->data[2] & 0x01));
                    break;
                case CURTAIN_CLOSE: // 联动"窗帘关"
                    if (data->data[2] == false)
                        panel_curtain_close(FUNC_ARGS);
                    break;
                case CURTAIN_OPEN: // 联动"窗帘开"
                    if (data->data[2] == true)
                        panel_curtain_open(FUNC_ARGS);
                    break;
                default:
                    break;
            }
        }
    });
}

static void panel_clean_room(FUNC_PARAMS) // 清理房间
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == CLEAN_ROOM &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            if (data->data[2] == true) {
                for (uint8_t j = 0; j < KEY_NUMBER; j++) {
                    const panel_cfg_t *p_cfg_j = &temp_cfg[j];
                    panel_status_t *p_status_j = &temp_status[j];
                    if (p_cfg_j->func == DND_MODE &&
                        (data->data[3] == p_cfg_j->group || data->data[3] == 0xFF)) {
                        panel_fast_exe(p_status_j, (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                    }
                }
            }
            panel_fast_exe(p_status, (0b00010110 & ~0x01) | (data->data[2] & 0x01));
        }
    });
}

static void panel_dnd_mode(FUNC_PARAMS) // 勿扰模式
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == DND_MODE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            if (data->data[2] == true) {
                for (uint8_t j = 0; j < KEY_NUMBER; j++) {
                    const panel_cfg_t *p_cfg_j = &temp_cfg[j];
                    panel_status_t *p_status_j = &temp_status[j];
                    if (p_cfg_j->func == CLEAN_ROOM &&
                        (data->data[3] == p_cfg_j->group || data->data[3] == 0xFF)) {
                        panel_fast_exe(p_status_j, (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                    }
                }
            }
            panel_fast_exe(p_status, (0b00010110 & ~0x01) | (data->data[2] & 0x01));
        }
    });
}

static void panel_later_mode(FUNC_PARAMS) // 请稍后
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == LATER_MODE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, (0b00100110 & ~0x01) | (data->data[2] & 0x01));
        }
    });
}

static void panel_chect_out(FUNC_PARAMS) // 退房
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == CHECK_OUT &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, (0b00010110 & ~0x01) | (data->data[2] & 0x01));
        }
    });
}

static void panel_sos_mode(FUNC_PARAMS) // 紧急呼叫
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == SOS_MODE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, (0b00010110 & ~0x01) | (data->data[2] & 0x01));
        }
    });
}

static void panel_service(FUNC_PARAMS) // 请求服务
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == SERVICE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, (0b00010110 & ~0x01) | (data->data[2] & 0x01));
        }
    });
}

